
#Run this file through homebrew to get all the nice apps

#Tap section
tap 'homebrew/bundle'
tap 'puma/puma'

#Brew section
brew 'brew-cask'
brew 'git'
brew 'rbenv'
brew 'ruby-build'
brew 'python3'
brew 'tmux'
brew 'zsh'
brew 'zsh-completions'
brew 'mas'
brew 'heroku-toolbelt'


#Cask section
cask 'iterm2'
cask 'dashlane'
cask 'google-chrome'
cask 'garmin-express'
cask 'spotify'
cask 'evernote'
cask 'skype'
